.SILENT: # Отключает показ команд перед выполнением 

include .env
export 

.PHONY: fmt lint test race run install_deps # Если в каталоге присутствует файл с совпадающей целью makefile то make может подумать что цель уже выполнена и не станет её исполнять. .PHONY невелирует это
# И заставляет в любом случае выполнится не взирая на дирректорию 

fmt: 
	go fmt ./...

lint: fmt # -> AST code -> AST -> assembler -> bin # && golanci-lint run -v --fast ./... 
	# go vet ./... 

test: lint 
	go test -v -cover ./...

race: test
	go test -v -race ./... 

run: race
	go run cmd/real-time-forum/main.go

install_deps: 
	go mod tidy

.DEFAULT_GOAL := run 

# Синтаксис makefile     

#	target: dependencies 
#		command 

# go fmt Форматирует всё файлы в проекте в соответствии со стандартами языка Go.
# go vet Проверяет код на наличие потенциальных ошибок, такие как неправильное использование функций, неподдерживаемые типы аргументов итд.
# go test Команда используемая для запусков тестов в Go. Флаг -v включает подробный режим выводя информацию о каждом тесте Флаг -cover включает сбор данных о покрытии кода тестами и показывает какая часть кода была выполнена во время тестов.

# <./...> это шаблон который указывает на текущий каталок и все подкаталоги.

# Неоднократный запуск makefile будет безопасным если он не изменяет состояние проекта, однако если есть к примеру <build> and <db> то это может быть опасно т.к состояние некоторых файлов может измениться